FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/ур_УправлениеЗапасамиПодборНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ур_УправлениеЗапасамиПодборНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_БрендыСиУС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыДляПодбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРезерве</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЗаказахПокупателей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЗаказахПоставщикам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗамена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАналог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ур_ЗаменыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ур_ЗаменыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>АктуальнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗамененнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ГруппыАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАналогов</Name>
			<Comment>Группы аналогов номенклатуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование аналога</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоГруппе</Name>
					<Comment>Признак главного аналога для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоПроизводителю</Name>
					<Comment>Признак главного по производителю для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ номенклатуры по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы аналогов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>№ артикула для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель детали</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>Заказы поставщикам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/ур_УправлениеЗапасамиПодборНоменклатуры/Ext/ObjectModule.bsl
Функция ПолучитьПереченьСкладовДляРегистрацииПотерянныхПродаж() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СкладыКомпании.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	(НЕ СкладыКомпании.Ссылка В
	|				(ВЫБРАТЬ
	|					ур_НастройкиDMSСкладыДляИсключения.Склад КАК Склад
	|				ИЗ
	|					Справочник.ур_НастройкиDMS.СкладыДляИсключения КАК ур_НастройкиDMSСкладыДляИсключения
	|				ГДЕ
	|					ур_НастройкиDMSСкладыДляИсключения.Ссылка = &Ссылка))
	|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СкладыКомпании.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Справочники.ур_НастройкиDMS.ОсновнаяНастройка);
	МассивСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");

	Возврат МассивСкладов;


КонецФункции






Процедура РегистрацияПотеряннойПродажи(Номенклатура, Количество) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) - СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК СвободныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			(Номенклатура = &Номенклатура
	|				ИЛИ Номенклатура В
	|					(ВЫБРАТЬ
	|						ЗаменыНоменклатуры.ЗамененнаяНоменклатура
	|					ИЗ
	|						РегистрСведений.ур_ЗаменыНоменклатуры КАК ЗаменыНоменклатуры
	|					ГДЕ
	|						ЗаменыНоменклатуры.АктуальнаяНоменклатура = &Номенклатура)
	|				ИЛИ номенклатура.артикул В
	|					(ВЫБРАТЬ
	|						ГруппыАналогов.Артикул
	|					ИЗ
	|						РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|					ГДЕ
	|						ГруппыАналогов.ИдентификаторГруппы В
	|							(ВЫБРАТЬ
	|								ГруппыАналогов.ИдентификаторГруппы
	|							ИЗ
	|								РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|							ГДЕ
	|								ГруппыАналогов.Артикул = &Артикул)))
	|				И СкладКомпании В (&ПереченьСкладов)) КАК ОстаткиТоваровКомпанииОстатки";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПереченьСкладов", ПолучитьПереченьСкладовДляРегистрацииПотерянныхПродаж());
	Запрос.УстановитьПараметр("Артикул", Номенклатура.Артикул);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		АктуальнаяЗамена = ПоискАктуальнойЗамены(Номенклатура.Артикул,Бренд);
		Если АктуальнаяЗамена <> Номенклатура.Артикул Тогда
			ТекНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", АктуальнаяЗамена);
			Если ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ур_КаталогДистрибьютораСрезПоследних.ДатаЗамены,
				|	ур_КаталогДистрибьютораСрезПоследних.Замена,
				|	ур_КаталогДистрибьютораСрезПоследних.НаименованиеИностранное,
				|	ур_КаталогДистрибьютораСрезПоследних.Наименование,
				|	ур_КаталогДистрибьютораСрезПоследних.Бренд,
				|	ур_КаталогДистрибьютораСрезПоследних.Артикул
				|ИЗ
				|	РегистрСведений.ур_КаталогДистрибьютора.СрезПоследних(
				|			&НаДату,
				|			Артикул = &Артикул
				|				И Бренд = &Бренд) КАК ур_КаталогДистрибьютораСрезПоследних";
				
				Запрос.УстановитьПараметр("Артикул",  АктуальнаяЗамена);
				Запрос.УстановитьПараметр("Бренд", Бренд);
				Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
				
				ДанныеПоНоменклатуре=Запрос.Выполнить().Выгрузить();
				
				
				
				//Отбор = Новый Структура;
				//Отбор.Вставить("Артикул", АктуальнаяЗамена);
				//Отбор.Вставить("Бренд",Бренд);
				//ДанныеПоНоменклатуре = РегистрыСведений.ур_КаталогДистрибьютора.СрезПоследних(ТекущаяДата(), Отбор);
				Если ДанныеПоНоменклатуре.Количество() <> 0 Тогда
					Номенклатура = СозданиеНоменклатуры(ДанныеПоНоменклатуре[0].Артикул, ДанныеПоНоменклатуре[0].Наименование, ДанныеПоНоменклатуре[0].НаименованиеИностранное,Бренд).Ссылка;
				Иначе
					Номенклатура = СозданиеНоменклатуры(АктуальнаяЗамена, АктуальнаяЗамена, АктуальнаяЗамена,Бренд).Ссылка;
				КонецЕсли;
			Иначе
				Номенклатура = ТекНоменклатура;
			КонецЕсли;
		КонецЕсли;
		ФормаВыбора = Справочники.ур_ТочкиВозникновенияПотеряныхПродаж.ПолучитьФормуВыбора();
		ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
		ЗаписатьПотеряннуюПродажу(Номенклатура, Количество, Номенклатура.Артикул, Неопределено, ВыбранноеЗначение);
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СвободныйОстаток = ?(ЗначениеЗаполнено(Выборка.СвободныйОстаток), Выборка.СвободныйОстаток, 0);
		Если СвободныйОстаток < Количество Тогда
			АктуальнаяЗамена = ПоискАктуальнойЗамены(Номенклатура.Артикул,Бренд);
			Если АктуальнаяЗамена <> Номенклатура.Артикул Тогда
				ТекНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", АктуальнаяЗамена);
				Если ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ур_КаталогДистрибьютораСрезПоследних.ДатаЗамены,
					|	ур_КаталогДистрибьютораСрезПоследних.Замена,
					|	ур_КаталогДистрибьютораСрезПоследних.НаименованиеИностранное,
					|	ур_КаталогДистрибьютораСрезПоследних.Наименование,
					|	ур_КаталогДистрибьютораСрезПоследних.Бренд,
					|	ур_КаталогДистрибьютораСрезПоследних.Артикул
					|ИЗ
					|	РегистрСведений.ур_КаталогДистрибьютора.СрезПоследних(
					|			&НаДату,
					|			Артикул = &Артикул
					|				И Бренд = &Бренд) КАК ур_КаталогДистрибьютораСрезПоследних";
					
					Запрос.УстановитьПараметр("Артикул",  АктуальнаяЗамена);
					Запрос.УстановитьПараметр("Бренд", Бренд);
					Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
					
					ДанныеПоНоменклатуре=Запрос.Выполнить().Выгрузить();

					//Отбор = Новый Структура;
					//Отбор.Вставить("Артикул", АктуальнаяЗамена);
					//Отбор.Вставить("Бренд",Бренд);
					//ДанныеПоНоменклатуре = РегистрыСведений.ур_КаталогДистрибьютора.СрезПоследних(ТекущаяДата(), Отбор);
					Если ДанныеПоНоменклатуре.Количество() <> 0 Тогда
						Номенклатура = СозданиеНоменклатуры(ДанныеПоНоменклатуре[0].Артикул, ДанныеПоНоменклатуре[0].Наименование, ДанныеПоНоменклатуре[0].НаименованиеИностранное,Бренд).Ссылка;
					Иначе
						Номенклатура = СозданиеНоменклатуры(АктуальнаяЗамена, АктуальнаяЗамена, АктуальнаяЗамена,Бренд).Ссылка;
					КонецЕсли;
				Иначе
					Номенклатура = ТекНоменклатура;
				КонецЕсли;
			КонецЕсли;
			ФормаВыбора = Справочники.ур_ТочкиВозникновенияПотеряныхПродаж.ПолучитьФормуВыбора();
			ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
			ЗаписатьПотеряннуюПродажу(Номенклатура, Количество - СвободныйОстаток, Номенклатура.Артикул, Неопределено, ВыбранноеЗначение);
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры




Процедура ЗаписатьПотеряннуюПродажу(Номенклатура, Количество, Артикул, ДокументОснование = Неопределено, ТочкаВозникновенияПотеряныхПродаж)
	ДатаИВремяРегистрации = ТекущаяДата();
	Ответственный = ПараметрыСеанса.Пользователь;

	НаборЗаписей = РегистрыСведений.ур_ПотерянныеПродажи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПериодРегистрации.Установить(НачалоДня(ДатаИВремяРегистрации));
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.Ответственный.Установить(Ответственный);
	НаборЗаписей.Отбор.ДатаИВремяРегистрации.Установить(ДатаИВремяРегистрации);
	НаборЗаписей.Очистить();
	НаборЗаписей.Прочитать();

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДатаИВремяРегистрации = ДатаИВремяРегистрации;
	НоваяЗапись.ДокументОснование = ДокументОснование;
	НоваяЗапись.Количество = Количество;
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Ответственный = Ответственный;
	НоваяЗапись.ТочкаВозникновенияПотеряныхПродаж = ТочкаВозникновенияПотеряныхПродаж;
	НоваяЗапись.ПериодРегистрации = ДатаИВремяРегистрации;
 	НаборЗаписей.Записать();

КонецПроцедуры




Процедура ОбновитьКоличествоВТоварахДляПодбора(СтрокаТаблицы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(Таблица.Остаток) КАК Остаток,
	|	СУММА(Таблица.ВРезерве) КАК ВРезерве,
	|	СУММА(Таблица.ВЗаказахПокупателей) КАК ВЗаказахПокупателей,
	|	СУММА(Таблица.ВЗаказахПоставщикам) КАК ВЗаказахПоставщикам
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК Остаток,
	|		СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК ВРезерве,
	|		СУММА(0) КАК ВЗаказахПокупателей,
	|		СУММА(0) КАК ВЗаказахПоставщикам
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|				,
	|				(Номенклатура = &Номенклатура
	|					ИЛИ Номенклатура В
	|						(ВЫБРАТЬ
	|							ЗаменыНоменклатуры.ЗамененнаяНоменклатура
	|						ИЗ
	|							РегистрСведений.ур_ЗаменыНоменклатуры КАК ЗаменыНоменклатуры
	|						ГДЕ
	|							ЗаменыНоменклатуры.АктуальнаяНоменклатура = &Номенклатура))
	|					И СкладКомпании В (&СкладКомпании)) КАК ОстаткиТоваровКомпанииОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(ЗаказыПокупателейОстатки.ЗаказаноОстаток),
	|		СУММА(0)
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				Номенклатура = &Номенклатура
	|					ИЛИ Номенклатура В
	|						(ВЫБРАТЬ
	|							ЗаменыНоменклатуры.ЗамененнаяНоменклатура
	|						ИЗ
	|							РегистрСведений.ур_ЗаменыНоменклатуры КАК ЗаменыНоменклатуры
	|						ГДЕ
	|							ЗаменыНоменклатуры.АктуальнаяНоменклатура = &Номенклатура)) КАК ЗаказыПокупателейОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток)
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				Номенклатура = &Номенклатура
	|					ИЛИ Номенклатура В
	|						(ВЫБРАТЬ
	|							ЗаменыНоменклатуры.ЗамененнаяНоменклатура
	|						ИЗ
	|							РегистрСведений.ур_ЗаменыНоменклатуры КАК ЗаменыНоменклатуры
	|						ГДЕ
	|							ЗаменыНоменклатуры.АктуальнаяНоменклатура = &Номенклатура)) КАК ЗаказыПоставщикамОстатки) КАК Таблица";
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	Запрос.УстановитьПараметр("СкладКомпании", ПолучитьПереченьСкладовДляРегистрацииПотерянныхПродаж());

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы.Остаток = Выборка.Остаток;
		СтрокаТаблицы.ВРезерве = Выборка.ВРезерве;
		СтрокаТаблицы.ВЗаказахПокупателей = Выборка.ВЗаказахПокупателей;
		СтрокаТаблицы.ВЗаказахПоставщикам = Выборка.ВЗаказахПоставщикам;
	КонецЦикла;


КонецПроцедуры



Функция ПоискАктуальнойЗамены(Артикул,ТекБренд) Экспорт
	ТЗКаталог = Новый ТаблицаЗначений;
	ТЗКаталог.Колонки.Добавить("Артикул");
	ТЗКаталог.Колонки.Добавить("Замена");
	ТЗКаталог.Колонки.Добавить("ДатаЗамены");
	ОтборЗамен = Новый Структура;
	НоваяСтрока = ТЗКаталог.Добавить();
	НоваяСтрока.Артикул = Артикул;
	НоваяСтрока.Замена = Артикул;
	ДобавленоСтарый = 1;
	ДобавленоНовый = 0;
	МассивИсключений = Новый Массив;
	Пока ДобавленоНовый <> ДобавленоСтарый Цикл
		ДобавленоСтарый = ДобавленоНовый;
		ТЗКаталогНовый = ТЗКаталог.Скопировать();
		Для каждого ТекСтрока Из ТЗКаталог Цикл
			Если МассивИсключений.Найти(ТекСтрока.Замена) = Неопределено Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ур_КаталогДистрибьютора.Артикул,
				|	ур_КаталогДистрибьютора.Замена,
				|	ур_КаталогДистрибьютора.ДатаЗамены
				|ИЗ
				|	РегистрСведений.ур_КаталогДистрибьютора КАК ур_КаталогДистрибьютора
				|ГДЕ
				|	ур_КаталогДистрибьютора.Артикул = &Артикул
				|	И ур_КаталогДистрибьютора.Бренд = &Бренд";
				
				Запрос.УстановитьПараметр("Артикул",  ТекСтрока.Замена);
				Запрос.УстановитьПараметр("Бренд", ТекБренд);
				
				Результат = Запрос.Выполнить();
				
				ВыборкаИзКаталога = Результат.Выбрать();
				
				Пока ВыборкаИзКаталога.Следующий() Цикл
					//
					//
					//
					//ОтборЗамен.Вставить("Артикул", ТекСтрока.Замена);
					//ОтборЗамен.Вставить("Бренд", ТекБренд);
					//ВыборкаИзКаталога = РегистрыСведений.ур_КаталогДистрибьютора.Выбрать(, , ОтборЗамен);
					//Пока ВыборкаИзКаталога.Следующий() Цикл
					Если ВыборкаИзКаталога.Замена <> "" Тогда
						НоваяСтрока = ТЗКаталогНовый.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИзКаталога);
						ДобавленоНовый = ДобавленоНовый + 1;
					КонецЕсли;
				КонецЦикла;
				МассивИсключений.Добавить(ТекСтрока.Замена);
			КонецЕсли;
		КонецЦикла;
		ТЗКаталог.Очистить();
		ТЗКаталог = ТЗКаталогНовый.Скопировать();
	КонецЦикла;

	Возврат ТЗКаталог[ТЗКаталог.Количество() - 1].Замена;

КонецФункции


Функция СозданиеНоменклатуры(Артикул, Наименование, НаименованиеИностранное,ТекБренд) Экспорт
	НастройкиБренда=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
	//РодительскаяГруппа = Справочники.ур_НастройкиDMS.ОсновнаяНастройка.ГруппаДляСозданияНовойНоменклатурыИзКаталога;
	РодительскаяГруппа = НастройкиБренда.ГруппаДляСозданияНовойНоменклатурыИзКаталога;
	ТипНоменклатуры = РодительскаяГруппа.ТипНоменклатуры;

	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	НоваяНоменклатура.Артикул = Артикул;
	НоваяНоменклатура.Наименование = Наименование;
	НоваяНоменклатура.НаименованиеИностранное = НаименованиеИностранное;
	НоваяНоменклатура.НаименованиеПолное = Наименование;
	НоваяНоменклатура.СтавкаНДС = РодительскаяГруппа.СтавкаНДС;
	НоваяНоменклатура.ТипНоменклатуры = ТипНоменклатуры;
	НоваяНоменклатура.БазоваяЕдиницаИзмерения = РодительскаяГруппа.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
	НоваяНоменклатура.ВидНоменклатуры = РодительскаяГруппа.ВидНоменклатуры;
	НоваяНоменклатура.ВалютаУчета = РодительскаяГруппа.ВалютаУчета;
	НоваяНоменклатура.СпособРаспределенияДопРасходов = РодительскаяГруппа.СпособРаспределенияДопРасходов;
	НоваяНоменклатура.СтатьяДопРасходов = РодительскаяГруппа.СтатьяДопРасходов;
	НоваяНоменклатура.ПроцентНаценки = РодительскаяГруппа.ПроцентНаценки;
	НоваяНоменклатура.Родитель = РодительскаяГруппа;
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.ТипНоменклатуры) Тогда
		НоваяНоменклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.ВидНоменклатуры) Тогда
		НоваяНоменклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.СтавкаНДС) Тогда
		НоваяНоменклатура.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.БазоваяЕдиницаИзмерения) Тогда
		НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
	КонецЕсли;
	НоваяНоменклатура.УстановитьНовыйКод();
	НоваяНоменклатура.Записать();


	спрЕдиницыИзмерения = Справочники.ЕдиницыИзмерения;
	Если ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 Тогда
		Выборка = спрЕдиницыИзмерения.Выбрать(, ТипНоменклатуры, Новый Структура("ЕдиницаПоКлассификатору", НоваяНоменклатура.БазоваяЕдиницаИзмерения));
		Если Выборка.Следующий() = Ложь Тогда
			НоваяЕдиницаИзмерения = спрЕдиницыИзмерения.СоздатьЭлемент();
			НоваяЕдиницаИзмерения.Владелец = ТипНоменклатуры;
			НоваяЕдиницаИзмерения.УстановитьНовыйКод("");
			НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = НоваяНоменклатура.БазоваяЕдиницаИзмерения;
			НоваяЕдиницаИзмерения.Наименование = НоваяНоменклатура.БазоваяЕдиницаИзмерения.Наименование;
			НоваяЕдиницаИзмерения.Коэффициент = 1;
			НоваяЕдиницаИзмерения.Записать();
		Иначе
			НоваяЕдиницаИзмерения = Выборка.Ссылка;
		КонецЕсли;
	Иначе
		Если обЗначениеНеЗаполнено(НоваяНоменклатура.ОсновнаяЕдиницаИзмерения) Тогда
			НоваяЕдиницаИзмерения = спрЕдиницыИзмерения.СоздатьЭлемент();
			НоваяЕдиницаИзмерения.Владелец = НоваяНоменклатура.Ссылка;
			НоваяЕдиницаИзмерения.УстановитьНовыйКод("");
			НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = НоваяНоменклатура.БазоваяЕдиницаИзмерения;
			НоваяЕдиницаИзмерения.Наименование = НоваяНоменклатура.БазоваяЕдиницаИзмерения.Наименование;
			НоваяЕдиницаИзмерения.Коэффициент = 1;
			НоваяЕдиницаИзмерения.Записать();
		КонецЕсли;
	КонецЕсли;

	НоваяНоменклатура.ОсновнаяЕдиницаИзмерения = НоваяЕдиницаИзмерения.Ссылка;
	НоваяНоменклатура.Записать();

	Возврат НоваяНоменклатура;

КонецФункции
